# >는 오른쪽 정렬 <는 왼쪽정렬 
#  빈자리는 빈공간으로 두고, 오른쪽으로 정렬을 하되, 총 10자리 공간 확보
print("{0: >10}".format(500))

# 양수일땐 +로 표시 , 음수일땐 -로 표시
print("{0: >+10}".format(500))
print("{0: >+10}".format(-500))

# 왼쪽 정렬하고, 빈칸으로 _로 채움
print("{0:_<+10}".format(500))

#세자리마다 콤마
print("{0:,}".format(100000000000))

#세자리마다 콤마 +- 부호붙이기
print("{0:+,}".format(100000000000))
print("{0:+,}".format(-100000000000))

#세자리마다 콤마, 부호 붙이고 자릿수 확보
#빈자리는 ^로 표시
print("{0:^<+30,}".format(10000000000))

#소수점 출력
print("{0:f}".format(5/3))

#소수점 특정 자리수까지 출력 (소수점 셋째 자리에서 반올림)
print("{0:.2f}".format(5/3)) # 1.67

